# SetGlobal2DDirectionHandles Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExporterIFCUtils..::..SetGlobal2DDirectionHandles Method
ExporterIFCUtils Class See Also
---
Sets the handles representing the cardinal directions in 2D.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static void SetGlobal2DDirectionHandles(
	bool positive,
	IFCAnyHandle xDir,
	IFCAnyHandle yDir
)
```

Visual Basic
---
```text
Public Shared Sub SetGlobal2DDirectionHandles ( _
	positive As Boolean, _
	xDir As IFCAnyHandle, _
	yDir As IFCAnyHandle _
)
```

Visual C++
---
```text
public:
static void SetGlobal2DDirectionHandles(
	bool positive,
	IFCAnyHandle^ xDir,
	IFCAnyHandle^ yDir
)
```

# ### Parameters
positive
    Type: System..::..Boolean True if the handles returned should be in the positive direction, false if the handles should be in the negative direction.
xDir
    Type: Autodesk.Revit.DB.IFC..::..IFCAnyHandle The X direction handle.
yDir
    Type: Autodesk.Revit.DB.IFC..::..IFCAnyHandle The Y direction handle.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace